#Задача 6

a = int(input("Введите результаты пробежки первого дня, км "))
b = int(input("Введите общий желаемый результат, км "))
i = 1
while a < b:
    a = a + 0.1 * a
    i += 1

print(f'Вы достигнете требуемых результатов на день:', i)